tap "homebrew/cask-fonts"

brew "ack"
brew "aria2"
brew "asdf"
brew "asciinema"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "cmake"
brew "coreutils"
brew "crystal"
brew "ctags"
brew "rs/tap/curlie"
brew "direnv"
brew "duti"
brew "elixir"
brew "entr"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fpp"
brew "fx"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "golangci-lint"
brew "googler"
brew "grc"
brew "hexyl"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "janet"
brew "jo"
brew "jq"
brew "kakoune"
brew "lazydocker"
brew "lazygit"
brew "less"
brew "mas"
brew "micro"
brew "mtr"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nim"
brew "nushell"
brew "parallel"
brew "perl"
brew "pipx"
brew "postgresql"
brew "prettyping"
brew "progress"
brew "pstree"
brew "pup"
brew "pv"
brew "pypy3"
brew "python"
brew "rakudo"
brew "readline"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "rustup-init"
brew "scc"
brew "shellcheck"
brew "switchaudio-osx"
brew "syncthing"
brew "t-rec"
brew "tig"
brew "tmux"
brew "tokei"
brew "tree"
brew "uni"
brew "vim"
brew "vimpager"
brew "wget"
brew "xh"
brew "xsv"
brew "yarn"  # installs Node
brew "zig"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "arq"
cask "coconutbattery"
cask "coscreen"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "grandperspective"
cask "hammerspoon"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "julia"
cask "karabiner-elements"
cask "kdiff3"
cask "kindle"
cask "kitty"
cask "libreoffice"
cask "meld"
cask "osquery"
cask "rq"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "spotmenu"
cask "sublime-text"
cask "tableplus"
cask "visual-studio-code"
cask "vlc"

# cask-fonts tap
cask "font-fantasque-sans-mono"
cask "font-inter"
cask "font-victor-mono"

mas "Clear", id: 504544917
mas "Cyberduck", id: 409222199
mas "Fantastical", id: 975937182
mas "Horo", id: 1437226581
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
