brew "ack"
brew "aria2"
brew "asciidoctor"
brew "asciinema"
brew "ast-grep"
brew "atuin"
brew "awscli"
brew "borkdude/brew/babashka"
brew "babashka/brew/obb"
brew "bash"
brew "bash-completion"
brew "bat"
brew "blueutil"
brew "broot"
brew "oven-sh/bun/bun"
brew "cmake"
brew "coreutils"
brew "crystal"
brew "ctags"
brew "rs/tap/curlie"
brew "deno"
brew "direnv"
brew "dolt"
brew "dsq"
brew "duti"
brew "elixir"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fennel"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "findutils"
brew "fpp"
brew "fx"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glab"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "golangci-lint"
brew "gource"
brew "grc"
brew "helix"
brew "hexyl"
brew "htmlq"
brew "htop"
brew "httpie"
brew "hwatch"
brew "hyperfine"
brew "imagemagick"
brew "janet"
brew "jj"
brew "jjui"
brew "jless"
brew "jo"
brew "jq"
brew "just"
brew "kakoune"
brew "lazydocker"
brew "lazygit"
brew "less"
brew "libmagic"
brew "libqalculate"
brew "lnav"
brew "magic-wormhole"
brew "mas"
brew "mdq"
brew "micro"
brew "mprocs"
brew "mpv"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "node"
brew "nushell"
brew "ouch"
brew "openconnect"
brew "noborus/tap/ov"
brew "parallel"
brew "pastel"
brew "perl"
brew "pngcrush"
brew "poppler"
brew "postgresql@14"
brew "prettyping"
brew "progress"
brew "pstree"
brew "pv"
brew "pypy3"
brew "python"
brew "rakudo"
brew "readline"
brew "rename"
brew "renameutils"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "rustup"
brew "scc"
brew "sd"
brew "sevenzip"
brew "shellcheck"
brew "switchaudio-osx"
brew "syncthing"
brew "t-rec"
brew "tig"
brew "tmux"
brew "tokei"
brew "topfew"
brew "tree"
brew "ugrep"
brew "uni"
brew "uv"
brew "vim"
brew "vimpager"
brew "watchexec"
brew "watchman"
brew "wget"
brew "xh"
brew "xsv"
brew "yarn"
brew "yazi"
brew "yq"
brew "zbar"
brew "zellij"
brew "zig"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "bettertouchtool"
cask "coconutbattery"
cask "coscreen"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "grandperspective"
cask "hammerspoon"
cask "heynote"
cask "iina"
cask "insomnia"
cask "karabiner-elements"
cask "kdiff3"
cask "kitty"
cask "lapce"
cask "libreoffice"
cask "logseq"
cask "nordvpn"
cask "orion"
cask "osquery"
cask "rq"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "spotmenu"
cask "sublime-text"
cask "tableplus"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zed"

# cask-fonts tap
cask "font-fantasque-sans-mono"
cask "font-inter"
cask "font-noto-sans"
cask "font-noto-mono"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-iosevka"
cask "font-iosevka-aile"

# mas "Amazon Kindle", id: 302584613
mas "Cyberduck", id: 409222199
mas "Monodraw", id: 920404675
mas "Shazam", id: 897118787
mas "Xcode", id: 497799835
