tap "homebrew/cask-fonts"

brew "ack"
brew "aria2"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "diff-so-fancy"
brew "dtrx"
brew "duti"
brew "elixir"
brew "entr"
brew "exa"
brew "fasd"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fpp"
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "googler"
brew "hexyl"
brew "httpie"
brew "htop"
brew "hyperfine"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "less"
brew "libgit2"
brew "kakoune"
brew "mas"
brew "micro"
brew "minimal-racket"
brew "mtr"
cask "java"  #required for osquery
brew "osquery"
brew "ncdu"
brew "neofetch"
brew "nim"
brew "nushell"
brew "parallel"
brew "path-extractor"
brew "perl"
brew "postgresql"
brew "prettyping"
brew "progress"
brew "pstree"
brew "pup"
brew "pv"
brew "pyenv"
brew "pypy3"
brew "python"
brew "rakudo-star"
brew "ranger"
brew "readline"
brew "rethinkdb"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "rustup-init"
brew "shellcheck"
brew "switchaudio-osx"
brew "syncthing"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tokei"
brew "tree"
brew "vim"
brew "vimpager"
brew "wget"
brew "xsv"
brew "yarn"  # installs Node
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "alfred"
cask "appcleaner"
cask "caffeine"
cask "coconutbattery"
cask "cyberduck"
cask "dash"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "flycut"
cask "flux"
cask "google-chrome"
cask "grandperspective"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "julia"
cask "karabiner-elements"
cask "kdiff3"
cask "kindle"
cask "libreoffice"
cask "meld"
cask "rq"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "spotmenu"
cask "sublime-text"
# cask "vagrant"  # requires package installer, disable by default
# cask "virtualbox"  # requires kernel extensions, disable by default
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "font-fantasque-sans-mono"  # cask-fonts tap

mas "Xcode", id: 497799835
mas "Clear", id: 504544917
mas "Tweetbot", id: 1384080005
mas "Horo", id: 1437226581
